- Data cleaning first and convert date to day,month,year,time then find the sale of every month and tell which one has the most sale
- Kis month mai kis time pe hamari sb se zyada sale hui

In [23]:
import pandas as pd

data=pd.read_csv('all_data.csv')
#data.isnull().sum()
#186850 rows × 6 columns

data

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
...,...,...,...,...,...,...
186845,259353,AAA Batteries (4-pack),3,2.99,09/17/19 20:56,"840 Highland St, Los Angeles, CA 90001"
186846,259354,iPhone,1,700,09/01/19 16:00,"216 Dogwood St, San Francisco, CA 94016"
186847,259355,iPhone,1,700,09/23/19 07:39,"220 12th St, San Francisco, CA 94016"
186848,259356,34in Ultrawide Monitor,1,379.99,09/19/19 17:30,"511 Forest St, San Francisco, CA 94016"
186849,259357,USB-C Charging Cable,1,11.95,09/30/19 00:18,"250 Meadow St, San Francisco, CA 94016"

In [24]:
data.drop_duplicates(inplace=True)
#len(data)
data.shape

(185688, 6)

In [28]:
data.dropna(subset=["Quantity Ordered"],inplace=True)
#data=data.dropna(axis=1)
data.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [29]:
data.shape

(185687, 6)

In [ ]:
data.isnull().sum()

In [ ]:
data.dtypes

- This function attempts to convert all the values in the 'Quantity Ordered' column to a numeric type.
errors=coerce: If any value in the column cannot be converted to a number such as a string(abc) pandas will replace that value with NaN (Not a Number), instead of raising an error.
 After converting to numeric, any NaN values (which were non-numeric in the original data) are replaced with 0.
fillna(0) is used to substitute all NaN values with 0.

In [ ]:
data['Quantity Ordered'] = pd.to_numeric(data['Quantity Ordered'],errors='coerce') #.fillna(0)
#data.dtypes

In [ ]:
data.isnull().sum()

In [ ]:
#data.dropna(subset=["Quantity Ordered"],inplace=True)

In [ ]:
#data.isnull().sum()

In [ ]:
#data['Quantity Ordered'].fillna('', inplace=True)
#data['Quantity Ordered'].fillna(data['Quantity Ordered'].mean(), inplace=True)

In [ ]:
#data.isnull().sum()

In [ ]:
#data['Quantity Ordered']=data['Quantity Ordered'].astype('int64')
#data

In [ ]:
data[['Month','Date','Year']]=data['Order Date'].str.split("/",n=2,expand=True)
data

In [ ]:
data[['Day', 'Time']] = data['Year'].str.split(" ", n=2, expand=True)
data

In [ ]:
data=data.drop(columns='Year')
data

In [ ]:
data.rename(columns={'Day': 'Year'}, inplace=True)
data

In [ ]:
sales = data.groupby('Month')['Quantity Ordered'].sum().sort_values(ascending=False) 
print(sales.to_string())

In [ ]:
sales = data.groupby(['Month', 'Date','Time'])['Quantity Ordered'].sum().sort_values(ascending=False).reset_index()
#sales = data.groupby(['Month', 'Date', 'Time'])['Quantity Ordered'].sum().reset_index().sort_values(by='Month', ascending=False)
print(sales.to_string())

**_Original Output: Without reset_index(), the output is a Series where the Date is the index, and the values are the Quantity Ordered. A Series only displays the index and values, not the column name_**

**_Using reset_index(): By applying reset_index(), the index (Date) is turned back into a regular column, and the result is a DataFrame with two columns: Date and Quantity Ordered. This allows both column names to be shown in the output_**

In [ ]:
sales = data.groupby("Time")['Quantity Ordered'].sum().sort_values(ascending=False).reset_index()
pd.set_option('display.max_rows', 185687)
sales

In [ ]:
#sales= data.groupby(['Month','Date','Time'])['Quantity Ordered'].sum().value_counts()
#print(sales.to_string())

In [ ]:
# After running your existing code
sales = data.groupby("Time")['Quantity Ordered'].sum().sort_values(ascending=False).reset_index()
# Find the time with the highest quantity ordered
max_sales_time = sales.loc[sales['Quantity Ordered'].idxmax()]
max_sales_time